////ヘッダーファイル＜stdio.h＞を読み込ましてください。
//
//
////プログラムの始まりを示すmain関数を記述してください。
//
//{
//	//データ型が整数型で識別子numの変数を宣言してください。
//	
//	//変数numに値5を代入してください。
//
//	//データ型が文字型で識別子mojiの変数を宣言してください。
//
//	//変数mojiに英字bを代入してください。
//
//	//データ型が浮動小数点で識別子floatの変数を宣言してください。
//
//	//変数floatに値3.14を代入してください。
//
//	//出力結果が以下のようになるように、変換仕様を利用して、変数num・moji・floatの値をそれぞれ出力してください。
//	// なお、コードの最後には改行を示すエスケープシーケンスを記述すること。
//	//＜出力結果＞変数numの値は5で、変数mojiの値はbで、変数floatの値は3.14です。
//
//	
//
//	//変数numの値を変更します。変数numに値123を代入してください。
//
//	//出力結果が以下のようになるように、変換仕様を利用して、変数numの値を出力してください。
//	// なお、コードの最後には改行を示すエスケープシーケンスを記述すること。
//	//＜出力結果＞変数numの値を変更しました。変数numの値は123です。
//
//
//
//	//変数numを変数floatに代入してください。
//
//	//出力結果が以下のようになるように、変換仕様を利用して、変数floatの値を出力してください。
//	// なお、コードの最後には改行を示すエスケープシーケンスを記述すること。
//	//＜出力結果＞変数floatに変数numの値を代入したので変数floatの値は123です。
//
//
//
//
//	//scanf_sによる入力でキーボードから整数を入力させて、入力された値を変換仕様を利用して出力するコードを記述してください。
//	//なお、入力されてきた整数値が格納されるハコは、変数numを流用してください。
//	//＜出力結果＞
//	// 整数を入力してください。
//	//10
//	//キーボードから入力された値は10です。
//
//
//
//
//	//scanf_sによる入力でキーボードから一文字を入力させて、入力された一文字を変換仕様を利用して出力するコードを記述してください。
//	//なお、入力されてきた一文字が格納されるハコは、変数mojiを流用してください。
//	//＜出力結果＞
//	// 一文字だけ入力してください。
//	//b
//	//キーボードから入力された一文字はbです。
//
//
//
//
//	//scanf_sによる入力でキーボードから小数を入力させて、入力された値を変換仕様を利用して出力するコードを記述してください。
//	//なお、入力されてきた小数が格納されるハコは、変数floatを流用してください。
//	//＜出力結果＞
//	// 小数を入力してください。
//	//3.14
//	//キーボードから入力された小数は3.14です。
//
//
//
//
//
//
//
//	return 0;
//}