//#include<stdio.h>
//int main(void)
//{
//	//データ型が整数型で識別子Test1，Test2の変数を宣言してください。
//	
//	//データ型が整数型で識別子ans1，ans2，ans3の変数を宣言して、ans1には値0を、ans2には値5を、ans3には値1を代入してください。
//	//なお、変数の初期化の記述をすること。
//	
//
//
//
//	//キーボードから整数を2つ入力し、それぞれ変数Test1，Test2に格納してください。
//	//＜出力結果＞整数を2つ入力してください。
//	//10
//	//5
//
//
//
//
//	//IF文を利用して、条件が「変数Test1と変数Test2が等しかったら」、
//	//条件が真の場合、「変数ans1の値を１増やす」というコードを記述してください。
//
//
//
//
//
//	//IF文を利用して、条件が「変数Test1と変数Test2が等しくなかったら」、
//	//条件が真の場合、「変数ans2の値を１増やす」、
//	//条件が偽の場合、「変数ans2の値を１減らす」というコードを記述してください。
//
//
//
//
//
//	//IF文を利用して、条件が「Test1がTest2より大きかったら」、
//	//条件が真の場合、「変数ans3の値を１減らす」、
//	//条件が偽の場合、再条件「Test1がTest2より小さかったら」、
//	//再条件が真の場合、「変数ans3の値を２倍にする」というコードを記述してください。
//
//
//
//
//
//	
//
//
//
//
//	//IF文を利用して、条件が「Test1がTest2以上だったら」、
//	//条件が真の場合、「変数ans2を半分にする」、
//	//条件が偽の場合、再条件「Test1がTest2以下だったら」、
//	//再条件が真の場合、「変数ans2の値に変数ans3の値を代入する」というコードを記述してください。
//
//
//
//
//
//
//	
//	//変数ans1，ans2，ans3の値を変換仕様を利用して、出力してください。
//
//
//
//
//
//
//
//	return 0;
//
//}